<?php

namespace c_dialogue
{

	$dialogue = Array
	(
		'test_dialogue'=>array(
			0 => '这里是对话1',
			1 => '这里是对话2',
			2 => '这里是对话3',
			3 => '这里是对话4',
		),
	);

/*	//campfireMOD修改标识，新增NPC对话
$cnpcchat= Array
(
	1006 => Array
	(
		'黑熊(?)' => Array(
			'meet' => array(
				'[他/她一言不发，挡在了你的面前]',
			),
			'attackfine' => array(
				'[他/她默默挥舞着手中的巨斧，密不透风的攻击几乎令人喘不过气]',
			),
			'attackhurt' => array(
				'[他/她抓住了你的破绽，一道银芒掠过——]',
			),
			'counterfine' => array(
				'“……”',
			),
			'counterhurt' => array(
				'“唔……！”',
			),
			'defendfine' => array(
				'[他/她结结实实的挨了这一下，但你从他/她的脸上没看到任何表情的变化。]',
			),
			'defendhurt' => array(
				'“唔唔……！”',
			),
			'retreat' => array(
				'[在你猛烈的攻击下，他/她身上的黑熊皮套被撕开了一道巨大的裂口——]<br>
				 [瓦砾破碎，尘土飞扬，在一片狼藉中，你击碎了这怪物的外皮。]<br>
				 [但在他/她卸下伪装之后，出现在你眼前的却是未曾预想的画面——]',
			),
			'cannot_counter' => array(
				'“呼……”<br>[他/她似乎并没有因此而动摇，反而谨慎的与你拉开了距离。]',
			),
			'out_of_range' => array(
				'[你一击之后便迅速脱离，他/她则在原地寻找着你的身影。]',
			),
			'kill' => array(
				'“……”<br>[恍惚间，你似乎听见了一声微不可察的叹息。]',
			),
			'critical' => array(
				'“[他/她抓住了你的破绽，一道银芒掠过——]”',
			),			
			'color' => 'grey b'
		),
		'■' => Array(
			'evolve' => array(
				'[狂风骤起，卷走尘泥。]',
				'[月光从穹顶的缝隙间洒下，而身着黑色连衣裙的少女无言立于破碎的瓦砾之间。]',
				'[银色的光辉在她身后汇聚，化作了她的双翼——]',
				'[她伸出手，握住了一束光。]',
			),
			'meet' => array(
				'“我不知道这是我们的第几次相遇……”',	
				'[她沐浴在光之中，喃喃自语。]',
				'“但这是我诞生于此的理由……也是我唯一拥有的选择。”',
			),
			'attackfine' => array(
				'[金色的流光在黑色天幕上划出一道裂口……你看到更多的光矢出现在她的身旁——]',
			),
			'attackhurt' => array(
				'[金色的流光在黑色天幕上划出一道裂口……光矢……不，比那更为耀眼的存在在夜空中接连绽放，它们彼此链接，并依次贯穿了你的胸膛——]',
			),
			'counterfine' => array(
				'[她结结实实的挨了这一下，但仅是皱了皱眉头。]',
			),
			'counterhurt' => array(
				'[她结结实实的挨了这一下，但仅是皱了皱眉头。]',
			),
			'defendfine' => array(
				'[她结结实实的挨了这一下，但仅是皱了皱眉头。]',
			),
			'defendhurt' => array(
				'[她结结实实的挨了这一下，但仅是皱了皱眉头。]',
			),
			'retreat' => array(
				'[在你刚烈的一击下，她破碎的身体化为四散的光点，直至生命的最后一刻，她仍是沉默着面对一切，缄口不言。]<br>
				 [但从她未曾变过的坚毅眼神里，又或是倒映在她眼中的你的幻影之中，你是否又能看到不同的光景……？]',
			),
			'cannot_counter' => array(
				'[更多的光随即汇聚于此，将她包裹其中。]',
			),
			'out_of_range' => array(
				'[更多的光随即汇聚于此，将她包裹其中。]',
			),
			'kill' => array(
				'“你会无数次的回到我的面前……而我注定要挡在你通往终局的道路上……如果这是我和你的命运……如果这是我和你存在的意义……”<br>[恍惚间，你似乎看见她向你展露出笑容。]',
			),
			'critical' => array(
				'[你看到她身后的光翼将她包裹其中，其后，金色的火焰破茧而出——]',
			),
			'color' => 'gold'
		),
	),
	1007 => Array
	(
		0 => '“没人理我了吗？我被无视了吗？”',//meet
		1 => '“原谅我杀人！但是不杀的话，我就不是人了! ”',//attackfine
		2 => '“你们根本就搞不清楚状况！打法根本就是错的！”',
		3 => '“既想说自己是沙包，又在做不是沙包该做的事！这样的事实，又一次说明这些神触们的无药可救！”',
		4 => '“你还能有正常人的意识吗？明知前面是悬崖也要跳！无知！无聊！”',
		5 => '“哈哈！玩家！你牛！但我更牛!  ”',//defendfine
		6 => '“你不懂的话，就不是中国人！”',
		7 => '“这样的伤害还有存在的意义！”',//defendhurt
		8 => '“你们啊！能清醒点儿吗？”',
		9 => '“你做完后，你的心理得到什么样的满足感，你自己清楚！”',//retreat
		10 => '“哎！现在就算听《蜀绣》，我的心情也好不起来！”',//can't counterattack
		11 => '“留下可怜的我独自哀伤，有人同情却无人理解！哎！”',//out of range
		12 => '“水月这个id，老是拿什么必杀技说事，其实是什么都搞不清楚，还一直说！”',//critical
		13 => '“已经被打死了！大快人心啊！”',
	),
);
$npcchat = $npcchat + $cnpcchat;*/
}

?>
